<template>
  <div class="article-details">
    <div class="container">
      <Row :gutter="10">
        <Col span="6">
          <Affix :offset-top="60">
            <div class="user">
              <div class="info">
                <div class="author">
                  <svg class="memberhead" viewBox="0 0 1303 1024" style="display: inline;">
                    <path d="M1129.770822 419.281455A93.090909 93.090909 0 1 1 1210.201367 465.454545h-2.141091l-56.971636 478.952728c-5.399273 45.242182-46.731636 79.592727-95.790545 79.592727H249.875549c-48.965818 0-90.112-34.164364-95.697454-79.406545L95.34464 465.454545H93.110458a93.090909 93.090909 0 1 1 80.337455-46.08l229.189818 142.056728 187.485091-398.429091A93.184 93.184 0 0 1 651.655913 0a93.090909 93.090909 0 0 1 61.160727 163.281455l187.485091 398.149818 229.469091-142.149818z" fill="#FDD840"></path>
                    <path d="M1117.110458 372.363636a93.090909 93.090909 0 1 1 93.090909 93.090909h-2.141091l-56.971636 478.952728c-5.399273 45.242182-46.731636 79.592727-95.790545 79.592727H652.586822C651.935185 845.451636 651.655913 504.087273 651.655913 0a93.090909 93.090909 0 0 1 61.160727 163.281455l187.485091 398.149818 229.469091-142.149818A93.090909 93.090909 0 0 1 1117.110458 372.363636z" fill="#FFBE00"></path>
                  </svg>
                  <a href="javascript:;" class="photo">
                    <img src="https://profile.csdnimg.cn/2/E/0/3_sinat_33921105" class="avater-pic" />
                    <img src="https://g.csdnimg.cn/static/user-reg-year/2x/4.png" class="user-years">
                  </a>
                </div>
                <div class="infos">
                  <a href="javascript:;">my name is bytegeek</a>
                  <div class="profile">
                    <span class="flag expert">
                      <a href="https://blog.csdn.net/home/help.html#classicfication" target="_blank">
                        <svg class="icon" viewBox="0 0 1024 1024"><path d="M814.66595322 678.72090158c27.28790414-49.4323607 42.81762539-106.26236606 42.81762538-166.72090158 0-72.93418327-22.60135568-140.59039435-61.1796362-196.34541431a980.97567257 980.97567257 0 0 0 40.71492003-31.83508021c14.3880795-11.86362114 26.94007909-21.60878179 37.65478688-29.23911774l52.87910078 45.68506103 6.3020564 74.66482493 38.78915701 64.11130434-17.07978473 72.95842196 17.07978473 72.95842196-38.78915701 64.11130434-6.3020564 74.66482493-56.70154035 48.98636903-29.06702314 69.06447828-69.06326634 29.06702312-48.98636903 56.70032843-74.66603685 6.3020564-64.11130434 38.78915701-72.95842198-17.07978473-72.95842195 17.07978473-64.11130434-38.78915701-74.66482494-6.3020564-48.98636902-56.70032843-69.06326635-29.06702312-29.06823505-69.06326635-56.70032844-48.98636902-6.30205638-74.66724879-38.78915704-64.11009242L68.43218542 512l-17.0785728-72.95842196 38.78794511-64.11130434 6.30205638-74.66482493 56.70154036-48.98636903 29.06823507-69.06447828 69.06326633-29.06702312 48.98636903-56.70032843 74.66603687-6.3020564 64.11009241-38.78915701 72.95842195 17.07978473 72.95842197-17.07978473 64.11130434 38.78915701 74.66603686 6.3020564 22.42804911 25.95962455c-69.22687743 2.08452635-129.82478534 18.10144502-181.79493568 48.05317991a348.21770153 348.21770153 0 0 0-52.36766467-3.94242104c-190.80445243 0-345.48236667 154.67791423-345.48236666 345.48236667S321.19554757 857.48236667 512 857.48236667c121.72664289 0 228.75131539-62.95390746 290.28968402-158.08102468h-23.00735351l5.556717-52.69488681c1.20466231-11.60547922 8.68471847-34.30257766-27.42970038-33.45180005-12.49988644 0.30298349-18.69892845 2.00938644-18.69892845 2.00938643s-1.08589279 14.02328738-2.40205304 24.38411045l-6.29599671 59.75318998H697.45012838l6.46203166-58.89150496 4.27085514-45.76747254c104.60201661-19.64181302 113.6272885 15.65212657 110.3938488 46.88123981l-3.91091076 37.09729728zM972.6439635 128.99494725a1002.89955715 1002.89955715 0 0 1-57.47717806 60.54337088c-3.21889648 3.11830598-172.39760006 25.92326654-188.7271977 45.26451997s130.10595402 7.09950891 125.67754746 10.69652878a945.37147787 945.37147787 0 0 1-70.21702743 51.8332018c-4.52051351 3.02377514-159.41536391 10.83832505-175.30139373 26.77162029s102.30903763 17.44336491 96.45297291 20.57500216c-67.66348267 36.19198263-146.52644668 65.41170944-235.46300544 89.610394-58.64548236 15.95874586-107.90090073 72.10037275-147.76383122 168.42488068-18.42866718 46.73459582-30.12625338 77.03779153-35.08912276 90.90716332-2.74139453 7.81939765-16.64591238 12.7410613-26.98007293 9.07738506s-16.8895111-16.4035256-13.61728951-26.70132813c69.54803991-196.2945131 180.30910469-350.8185117 306.73077957-465.77044398 28.35198211-25.77783447 68.90086721-46.02925027 101.97212-53.78562735 138.62948527-32.51012739 229.1912474-28.82221247 319.80148691-27.44666748zM438.22473457 673.0902566c9.56943023 3.48309808 29.52513414 6.94680523 45.66445817 6.94680523 17.38640401 0 27.0685441-4.79683446 27.84175794-12.23932067 0.70413361-6.79046576-6.41355431-7.70789972-26.05173154-12.33991117-27.13156466-6.62564274-44.44525263-16.88345143-42.74733323-33.27122188 1.97060455-19.0297864 27.54241026-33.41301815 66.77755899-33.41301817 19.12916499 0 37.67538976 1.34282277 47.2848138 4.47930777l-3.29767219 23.99629161c-6.23782389-2.16087818-30.1165579-5.1628385-46.26557739-5.16283849-16.37443919 0-24.8531289 5.13254015-25.44091684 10.75591352-0.73806775 7.12132371 7.7745561 7.4533936 29.04520832 13.08888634 28.8052454 7.27766319 41.40329851 17.52698834 39.75385643 33.4178659-1.93182267 18.69286879-24.94038813 34.58495826-70.87874336 34.58495826-19.12431725 0-35.60540663-3.47825035-44.68642748-6.95044103l2.99953646-23.89327722z m137.84294015-81.08080309c7.46551295-0.80714799 18.93404363-1.63005111 34.70978747-1.63005112 26.34623148 0 47.64597012 4.56899088 60.83544695 14.16993138 11.84423019 8.95376779 19.72543647 23.45092135 17.54274349 44.45373617-2.01423418 19.54364639-12.21629391 33.22759228-27.07339183 41.69052683-13.59062699 7.9817968-30.71767712 11.39217885-56.47127292 11.39217886-15.18553201 0-29.67056622-0.81684347-40.68825747-2.44204685l11.14494431-107.6354872z m21.77118094 86.24242966c2.53900157 0.49083324 5.87545565 0.97803068 12.46110456 0.97803065 26.35471502 0 44.93487394-12.89982464 46.80367605-31.03399187 2.70988423-26.21413068-13.77120513-35.38241078-41.54024703-35.22243551-3.59580795 0-8.59503536 0-11.24189904 0.48113777l-6.48263454 64.79725896z m-175.81525372 22.08870761c-5.57489603 2.1366395-17.11977855 3.59338407-33.25061902 3.59338407-46.39161852 0-71.43138524-24.07627925-68.47184259-55.90408784 3.54369477-37.92141234 40.63978013-59.25629707 81.2565335-59.25629707 15.72969035 0 24.99007743 1.39978368 33.66873623 3.74729968l-2.78502414 25.54999089c-5.77122933-2.1511827-19.30004766-4.1229992-30.24865871-4.1229992-23.89691303 0-44.19559425 7.87029888-46.52250738 32.76463353-2.07483087 22.26443804 12.17387622 32.90400591 39.05699444 32.90400591 9.35612986 0 23.15520946-1.48098324 29.53240576-3.62125854l-2.23480616 24.34775244z"></path></svg>
                        博客专家
                      </a>
                      <span class="bubble hide hideAnimate bubble-expert">
                        已认证的专家
                      </span>
                    </span>
                    <span class="personal-home-page" style="right:-96px;">
                      <router-link :to="{name:'zhifou-user-home'}">TA的个人主页 &gt;</router-link>
                    </span>
                  </div>
                </div>
              </div>
              <ul class="achievement">
                <li v-for="(item,index) in achievement" :key='index'>
                  <p>{{item.name}}</p>
                  <span>{{tranNumber(item.number,0)}}</span>
                </li>
              </ul>
              <div class="medal">
                <div class="profile-medal">勋章:</div>
                <ul class="medal-badge">
                  <li v-for="i in 2" :key="i">
                    <div class="mouse-box">
                      <img src="https://csdnimg.cn/medal/github@120.png" alt="">
                      <div class="icon-arrow"></div>
                    </div>
                    <div class="grade-detail-box">
                      <div class="pos-box">
                        <div class="left-box">
                            <img src="https://csdnimg.cn/medal/github@120.png" alt="">
                            <p>GitHub</p>
                        </div>
                        <div class="right-box">
                          绑定GitHub第三方账户获取
                        </div>
                      </div>
                    </div>
                  </li>
                </ul>
              </div>
              <Row class="opration">
                <Col span="12">
                  <Button long type="info">关注</Button>
                </Col>
                <Col span="12">
                  <Button long type="error">私信</Button>
                </Col>
              </Row>
            </div>
          </Affix>
          <div class="official-account">
            <h5>原创者公众号</h5>
            <div class="box">
              <img src="../../../../assets/img/official-account.jpg" />
            </div>
          </div>
          <div class="aside-new-article">
            <h3 class="aside-title">最新文章</h3>
            <div class="aside-content">
              <ul class="inf_list clearfix">
                <li class="clearfix">
                  <a target="_blank">微服务到底行不行</a>
                </li>
                <li class="clearfix">
                  <a href="https://blog.csdn.net/yellowzf3/article/details/105283462" target="_blank">只公布一天！“技术领导力”公众号作者--老K的私人微信号！                </a>
                </li>
                <li class="clearfix">
                  <a href="https://blog.csdn.net/yellowzf3/article/details/105259890" target="_blank">
                    阿里技术专家：日活5亿的淘宝技术发展历程和架构经验分享！18页ppt详解
                  </a>
                </li>
                <li class="clearfix">
                  <a href="https://blog.csdn.net/yellowzf3/article/details/105259900" target="_blank">
                    [视频]老罗涂着李佳琦的口红，漂亮得不像实力派！4-1直播你看好吗?
                  </a>
                </li>
                <li class="clearfix">
                  <a href="https://blog.csdn.net/yellowzf3/article/details/105236606" target="_blank">
                    拼多多超过淘宝，只需要2年！黄峥：失败从来不是成功之母，成功才是！
                  </a>
                </li>
              </ul>
            </div>
          </div>
          <div class="aside-footer">
            <div class="footer_box">
              <Row class="contact-info">
                <Col span="12">
                  <svg t="1538012951761" width="17" height="17" style="" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="23083" xmlns:xlink="http://www.w3.org/1999/xlink">
                    <path d="M466.4934485 880.02006511C264.6019863 859.18313878 107.13744214 688.54706608 107.13744214 481.14947309 107.13744214 259.68965394 286.68049114 80.14660493 508.14031029 80.14660493s401.00286817 179.54304901 401.00286814 401.00286816v1.67343191C908.30646249 737.58941724 715.26799489 943.85339507 477.28978337 943.85339507c-31.71423369 0-62.61874229-3.67075386-92.38963569-10.60739903 30.09478346-11.01226158 56.84270313-29.63593923 81.5933008-53.22593095z m-205.13036267-398.87059202a246.77722444 246.77722444 0 0 0 493.5544489 0 30.85052691 30.85052691 0 0 0-61.70105383 0 185.07617062 185.07617062 0 0 1-370.15234125 0 30.85052691 30.85052691 0 0 0-61.70105382 0z" p-id="23084" fill="#8590A6"></path>
                  </svg>
                  <a href="http://bbs.csdn.net/forums/Service" target="_blank">
                    <span>客服论坛</span>
                  </a>
                </Col>
                <Col span="12">
                  <svg t="1538013544186" width="17" height="17" style="" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="23556" xmlns:xlink="http://www.w3.org/1999/xlink">
                    <path d="M902.60033922 650.96445566c-18.0718526-100.84369837-94.08399771-166.87723736-94.08399771-166.87723737 10.87530062-91.53186599-28.94715402-107.78733693-28.94715401-107.78733691C771.20003413 93.08221664 517.34798062 98.02553561 511.98620441 98.16348824 506.65661791 98.02553561 252.75857992 93.08221664 244.43541101 376.29988138c0 0-39.79946279 16.25547094-28.947154 107.78733691 0 0-75.98915247 66.03353901-94.0839977 166.87723737 0 0-9.63372291 170.35365477 86.84146124 20.85850523 0 0 21.70461757 56.79068296 61.50407954 107.78733692 0 0-71.1607951 23.19910867-65.11385185 83.46161052 0 0-2.43717093 67.16015592 151.93232126 62.56172014 0 0 108.5460788-8.0932473 141.10300432-52.14626271H526.33792324c32.57991817 44.05301539 141.10300431 52.1462627 141.10300431 52.14626271 154.3235077 4.59843579 151.95071457-62.56172013 151.95071457-62.56172014 6.00095876-60.26250183-65.11385185-83.46161053-65.11385185-83.46161052 39.77647014-50.99665395 61.4810877-107.78733693 61.4810877-107.78733692 96.45219231 149.49514952 86.84146124-20.85850523 86.84146125-20.85850523" p-id="23557" fill="#8590A6"></path>
                  </svg>
                  <a href="https://url.cn/5epoHIm?_type=wpa&amp;qidian=true" class="qqcustomer_s" target="_blank">
                    <span>QQ客服</span>
                  </a>
                </Col>
                <Col span="12">
                  <svg width="16" height="16" xmlns="http://www.w3.org/2000/svg">
                    <path d="M2.167 2h11.666C14.478 2 15 2.576 15 3.286v9.428c0 .71-.522 1.286-1.167 1.286H2.167C1.522 14 1 13.424 1 12.714V3.286C1 2.576 1.522 2 2.167 2zm-.164 3v1L8 10l6-4V5L8 9 2.003 5z" fill="#8590A6" fill-rule="evenodd"></path>
                  </svg>
                  <a href="mailto:webmaster@csdn.net" target="_blank">
                    <span>kefu@csdn.net</span>
                  </a>
                </Col>
                <Col span="12">
                  <svg t="1538013874294" width="17" height="17" style="" viewBox="0 0 1194 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="23784" xmlns:xlink="http://www.w3.org/1999/xlink">
                    <path d="M1031.29689505 943.85339507h-863.70679012A71.98456279 71.98456279 0 0 1 95.60554212 871.86883228v-150.85178906c0-28.58329658 16.92325492-54.46750945 43.13135785-65.93861527l227.99160176-99.75813425c10.55341735-4.61543317 18.24580594-14.0082445 20.72896295-25.23643277l23.21211998-105.53417343a71.95757195 71.95757195 0 0 1 70.28414006-56.51881307h236.95255971c33.79252817 0 63.02360485 23.5090192 70.28414004 56.51881307l23.21211997 105.53417343c2.48315701 11.25517912 10.17554562 20.62099961 20.72896296 25.23643277l227.99160177 99.75813425a71.98456279 71.98456279 0 0 1 43.13135783 65.93861527v150.85178906A71.98456279 71.98456279 0 0 1 1031.26990421 943.85339507z m-431.85339506-143.94213475c143.94213474 0 143.94213474-48.34058941 143.94213474-107.96334876s-64.45411922-107.96334877-143.94213474-107.96334877c-79.51500637 0-143.94213474 48.34058941-143.94213475 107.96334877s0 107.96334877 143.94213475 107.96334876zM1103.254467 296.07330247v148.9894213a35.97878598 35.97878598 0 0 1-44.15700966 35.03410667l-143.94213473-33.57660146a36.0057768 36.0057768 0 0 1-27.80056231-35.03410668V296.1002933c-35.97878598-47.98970852-131.95820302-71.98456279-287.91126031-71.98456279S347.53801649 248.11058478 311.53223967 296.1002933v115.385829c0 16.73431906-11.52508749 31.25538946-27.80056233 35.03410668l-143.94213473 33.57660146A35.97878598 35.97878598 0 0 1 95.63253297 445.06272377V296.07330247C162.81272673 152.13116772 330.77670658 80.14660493 599.47049084 80.14660493s436.63077325 71.98456279 503.81096699 215.92669754z" p-id="23785" fill="#8590A6"></path>
                  </svg>
                  <a>
                    <span>400-660-0108</span>
                  </a>
                </Col>
              </Row>
              <div class="copyright">
                <a href="//www.csdn.net/company/index.html#about" target="_blank">关于我们</a>
                <a href="//www.csdn.net/company/index.html#recruit" target="_blank">招聘</a>
                <a href="//www.csdn.net/company/index.html#advertisement" target="_blank">广告服务</a>
                <a href="https://www.csdn.net/gather/A" target="_blank">网站地图</a>
              </div>
            </div>
          </div>
        </Col>
        <Col span="18">
          <div class="detail-box">
            <div class="detail-content">
              <div class="article-header-box">
                <div class="article-header">
                  <div class="article-title-box">
                    <h1 class="title-article">这些软件太强了，Windows必装！尤其程序员！</h1>
                  </div>
                  <div class="article-info-box">
                    <div class="article-bar-top">
                      <span class="article-type type-1 float-left">原创</span>                                                                                                                                            <a class="follow-nickName" href="https://me.csdn.net/sinat_33921105" target="_blank" rel="noopener">ithuangqing</a>
                      <span class="time">最后发布于2020-01-08 01:00:48</span>
                      <span class="read-count">阅读数 253939</span>
                      <a class="un-collection">
                        <svg viewBox="0 0 1084 1024"><path d="M1043.275294 379.241412a45.116235 45.116235 0 0 0-36.382118-30.72l-293.165176-42.646588L582.595765 40.237176C575.006118 24.816941 558.561882 17.106824 542.117647 17.106824s-32.888471 7.710118-40.478118 23.130352l-131.132235 265.637648-293.165176 42.646588a45.176471 45.176471 0 0 0-24.997647 77.040941l212.148705 206.787765-50.115764 292.020706a44.995765 44.995765 0 0 0 17.950117 44.15247c13.914353 10.24 32.406588 11.444706 47.585883 3.493647L542.117647 834.138353l262.204235 137.878588c15.179294 8.011294 33.731765 6.746353 47.585883-3.493647a44.875294 44.875294 0 0 0 17.950117-44.15247l-50.115764-292.020706 212.148706-206.787765a44.995765 44.995765 0 0 0 11.38447-46.320941z m-303.646118 204.92047a45.357176 45.357176 0 0 0-13.010823 39.996236l38.671059 225.099294-202.209883-106.37553a45.537882 45.537882 0 0 0-41.923764 0.060236L318.945882 849.317647l38.610824-225.099294a45.357176 45.357176 0 0 0-13.010824-39.996235L180.946824 424.658824l226.063058-32.828236a45.056 45.056 0 0 0 33.972706-24.69647L542.117647 162.273882l101.135059 204.860236c6.565647 13.312 19.275294 22.588235 33.972706 24.69647l226.063059 32.828236-163.659295 159.503058z"></path></svg>
                        <span>收藏</span>
                      </a>
                    </div>
                    <div class="slide-content-box" v-if="article.slide_content_box_show">
                      <div class="tags-box artic-tag-box">
                        <span class="label">分类专栏：</span>
                        <a class="tag-link" target="_blank">那些好用的工具与网站</a>
                      </div>
                      <div class="tags-box artic-tag-box">
                        <span class="label">文章标签：</span>
                         <a class="tag-link" href="https://so.csdn.net/so/search/s.do?q=软件&amp;t=blog" target="_blank" rel="noopener">软件</a>
                         <a class="tag-link" href="https://so.csdn.net/so/search/s.do?q=Windows软件&amp;t=blog" target="_blank" rel="noopener">Windows软件</a>
                         <a class="tag-link" href="https://so.csdn.net/so/search/s.do?q=Windows必装&amp;t=blog" target="_blank" rel="noopener">Windows必装</a>
                         <a class="tag-link" href="https://so.csdn.net/so/search/s.do?q=程序员&amp;t=blog" target="_blank" rel="noopener">程序员</a>
                         <a class="tag-link" href="https://so.csdn.net/so/search/s.do?q=高效率工具&amp;t=blog" target="_blank" rel="noopener">高效率工具</a>
                      </div>
                      <div class="article-copyright">
                        <span class="creativecommons">
                          <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/"></a>
                          <span>
                            版权声明：本文为博主原创文章，遵循<a href="http://creativecommons.org/licenses/by-sa/4.0/" target="_blank" rel="noopener"> CC 4.0 BY-SA </a>版权协议，转载请附上原文出处链接和本声明。                            </span>
                          <div class="article-source-link2222">
                            本文链接：<a href="https://blog.csdn.net/sinat_33921105/article/details/103883774">https://blog.csdn.net/sinat_33921105/article/details/103883774</a>
                          </div>
                        </span>
                      </div>
                    </div>
                    <div class="operating">
                      <a class="href-article-edit slide-toggle" @click="article.slide_content_box_show=!article.slide_content_box_show">
                        <template v-if="article.slide_content_box_show">收起</template>
                        <template v-else>展开</template>
                      </a>
                    </div>
                  </div>
                </div>
              </div>
              <div :class="['article-main-box',article.open_read?'':'close']">
                <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                    <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"></path>
                </svg>
                <p>Windows可谓是大多数人的生产力工具，集娱乐办公于一体，虽然在程序员这个群体中都说苹果是信仰，但是大部分不都是从Windows过来的，而且现在依然有很多的程序员用Windows。</p>
                <p>所以，今天我就把我私藏的Windows必装的软件分享给大家，如果有一个你没有用过甚至没有听过，那你就赚了😁，这可都是提升你幸福感的高效率生产力工具哦！</p>
                <p>走起！😎</p>
                <h2><a name="t0"></a><a name="t0"></a><a id="NO1_ScreenToGif_6"></a>NO、1 ScreenToGif</h2>
                <blockquote>
                <p>屏幕，摄像头和白板录像机集成编辑器</p>
                </blockquote>
                <p>不知道这个有多少人听说过，或者用过，反正我是爱了，没办法，它就是这么的优秀，软件下载下来之后打开是这样的：<br>
                <img src="https://img-blog.csdnimg.cn/20200108000727350.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                怎么样，是不是心动了，我们使用下录像机：<br>
                <img src="https://img-blog.csdnimg.cn/20200108000646685.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                看到了吧，我们从名字也能猜到，看这个：<br>
                <img src="https://img-blog.csdnimg.cn/20200108000833203.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                啥也不说了，老铁们，赶紧下载体验去吧：https://www.screentogif.com/?l=zh_cn</p>
                <h2><a name="t1"></a><a name="t1"></a><a id="NO2_Bandizip_17"></a>NO、2 Bandizip</h2>
                <p>应该不少人用过吧，不过，也许就你不知道啊，哈哈😁，这是个解压缩软件，之前一直被人安利，在此之前我一直使用2345压缩，不知道有没有人跟我一样，不过试了这个之后，确实不错。</p>
                <p>觉得像是哥万能的解压缩软件啊，牛杯：</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108001307349.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                没有体验的也推荐使用一波的，不骗你的，赶紧试试去吧：https://cn.bandisoft.com/bandizip/</p>
                <h2><a name="t2"></a><a name="t2"></a><a id="NO3_TranslucentTB_25"></a>NO、3 TranslucentTB</h2>
                <p>好，我猜这货应该很少人知道吧，这是个啥呢？人家的功能很单一，就干一件事情，啥嘞？<strong>任务栏透明化</strong>，对，它就是干这个的，而且也只干这个。</p>
                <p>它是调用的Windows API，所以只能Windows用喽，就冲这点，使用Windows的还不赶快用起来，不然多不给面子啊，安装之后在你的状态栏有它的图标，右击：</p>
                <p><img src="https://img-blog.csdnimg.cn/2020010800172438.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                任务栏透明化走起来😎：https://github.com/TranslucentTB/TranslucentTB</p>
                <h2><a name="t3"></a><a name="t3"></a><a id="NO4_snipaste_33"></a>NO、4 snipaste</h2>
                <p>这个啊，使用Windows你可一定要安装啊，简直太好用了，我们平常非常频繁的一个需求就是截图了吧，在此之前我都是使用扣扣截图的，有了它，再也不爱扣扣了，因为它真的很强大，很好用</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108002000838.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"></p>
                <ul>
                <li>F1 截图</li>
                <li>F3 贴图</li>
                </ul>
                <p>简直爽的不要不要的😅：https://zh.snipaste.com/</p>
                <h2><a name="t4"></a><a name="t4"></a><a id="NO5_Everything_43"></a>NO、5 Everything</h2>
                <p>这个应该很多人都熟悉了，因为它也巨好用，因为大家都忍受不了Windows自己那急人的文件搜索吧😂，用上它，秒变光速，这个啊，人手一个，标配的，真滴，搜东西太方便了。</p>
                <p>你看人家的介绍：</p>
                <ul>
                <li>轻量安装文件</li>
                <li>干净简洁的用户界面</li>
                <li>快速文件索引</li>
                <li>快速搜索</li>
                <li>最小资源使用</li>
                <li>便于文件分享</li>
                <li>实时更新</li>
                </ul>
                <p>还不赶紧爱了：https://www.voidtools.com/zh-cn/</p>
                <h2><a name="t5"></a><a name="t5"></a><a id="NO6_listary_58"></a>NO、6 listary</h2>
                <p>这个不知道多少人用过，反正我是把它和Everything作为搭档来的，一般就是使用Everything来搜索文件，但是Everything有个不方便的地方，比如我想打开网易云音乐：</p>
                <p>使用Everything<br>
                <img src="https://img-blog.csdnimg.cn/2020010800293274.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                使用 listary<br>
                <img src="https://img-blog.csdnimg.cn/20200108003017669.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                所以啊，我是非常喜欢用 listary来搜索应用，然后用Everything来搜索文件，我一直都是这么用的，推荐给你哦：https://www.listary.com/</p>
                <h2><a name="t6"></a><a name="t6"></a><a id="NO7_typora_67"></a>NO、7 typora</h2>
                <p>现在都什么世纪啦，你怎么还能不会markdown呢？不行，这个必须会的，你要是不会，都不好意说自己是程序员吧，所以啊，别问了，不会的赶紧补课了，其实很简单的，语法就那么一丢丢，掌握基本的就ok了。</p>
                <p>会了markdown语法之后，自然要选一个好用的编辑器了，在Windows上啊，typora可是敢说第一没人敢说第二的存在啊，不过人家真的很好用，使用起来体验很爽，关键人家还完全免费。</p>
                <p>我先说了，即使以后它收费，我买了😎</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108004135268.gif" alt="在这里插入图片描述"><br>
                强烈推荐哦：https://www.typora.io/</p>
                <h2><a name="t7"></a><a name="t7"></a><a id="NO8_PicGo_77"></a>NO、8 PicGo</h2>
                <p>使用markdown一直有一个痛点，那就是图片的问题，不想word那样可以直接保存图片，markdown不行，如果插入图片，图片在本地会单独存放，以链接的形式插入在markdown中，如果本地图片丢失或者位置变了，那就不显示了。</p>
                <p>所以这里就需要一个图床，也就是把图片传上去，弄个链接，然后插入markdown中，那么图床不少，怎么传呢？使用这个工具，只要复制下图片，然后按个快捷键就可以直接将图片上传到你事先设定好的图床上，然后返回给你个链接，可以直接用。<br>
                <img src="https://img-blog.csdnimg.cn/2020010800463557.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                真的很方便，markdown必备啊：https://molunerfinn.com/PicGo/</p>
                <h2><a name="t8"></a><a name="t8"></a><a id="NO9__85"></a>NO、9 印象笔记</h2>
                <p>不说了，必装，这可是我主要的知识管理工具啊，祝愿大象越来越好：</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108004818905.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="1"></p>
                <h2><a name="t9"></a><a name="t9"></a><a id="NO10_potplayer_89"></a>NO、10 potplayer</h2>
                <p>这个曾经是我换mac后最为留恋的一个Windows上的软件，因为在mac上实在找不到能够与它媲美的播放器了，真的特别喜欢这个播放器，可惜没有mac版本的，只为Windows服务的啊，一定要安装啊，真的特别强大。</p>
                <p>你要仅仅以为它就是个播放器那你就错了，人家的功能强大着嘞，绝对神器级别的播放器，不服的你说一个来比比：</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108005126948.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"></p>
                <blockquote>
                <p>认准黑人，谨防假冒</p>
                </blockquote>
                <p>走起来：https://potplayer.daum.net/?lang=zh_CN</p>
                <h2><a name="t10"></a><a name="t10"></a><a id="NO11__99"></a>NO、11 火绒</h2>
                <p>这个之前也一直被人安利确实挺不错的，在如今很多杀毒软件都被叫流氓的情况下，火绒能被很多人推荐，说明它还是值得信赖的，大家使用Windows应该都有一个不好的体验：</p>
                <blockquote>
                <p>总是有烦人的各种弹窗</p>
                </blockquote>
                <p>使用火绒，帮你搞定</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108005453573.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                你还别说，真挺好用😎：https://www.huorong.cn/</p>
                <h2><a name="t11"></a><a name="t11"></a><a id="_109"></a>还不过瘾？放大招</h2>
                <p>以上可都是我使用Windows经验收藏啊，还没看过瘾，没办法了，只能拿出必杀技了：</p>
                <p><img src="https://img-blog.csdnimg.cn/20200108005648925.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"><br>
                就这一个图片就感觉很酷，不信你去看看吧：https://love.appinn.com/</p>
                <p>觉得好的记得回来给我点赞哦！😎</p>
                <h2><a name="t12"></a><a name="t12"></a><a id="_118"></a>感谢阅读</h2>
                <p>大学的时候选择了<mark>自学Java</mark>，工作了发现吃了<mark>计算机基础不好</mark>的亏，<mark>学历不行</mark>这是没办法的事，只能后天弥补，于是在<mark>编码之外</mark>开启了自己的逆袭之路，<em><strong>不断的学习Java核心知识，深入的研习计算机基础知识</strong></em>，所有心得全部书写成文，<em><strong>整理成有目录的PDF，持续原创，PDF在公众号持续更新</strong></em>，如果你也不甘平庸，那就与我一起在编码之外，不断成长吧！</p>
                <p>其实这里不仅有技术，更有那些技术之外的东西，比如，如何做一个精致的程序员，而不是“屌丝”，<mark>程序员本身就是高贵的一种存在啊，难道不是吗？</mark></p>
                <p>非常欢迎你的加入，未来的日子，编码之外，有你有我，一起做一个<mark>人不傻，钱很多，活得久</mark>的快乐的程序员吧！</p>
                <p><em><strong>回复关键字“PDF”，获取技术文章合集，已整理好，带有目录，欢迎一起交流技术！</strong></em></p>
                <p><strong>另外回复“庆哥”，看庆哥给你准备的惊喜大礼包，只给首次关注的你哦！</strong></p>
                <p>任何问题，可以加庆哥微信：H653836923，另外，我有个交流群，我会***不定期在群里分享学习资源，不定时福利***，感兴趣的可以说下我邀请你！</p>
                <p><mark>对了，如果你是个Java小白的话，也可以加我微信，我相信你在学习的过程中一定遇到不少问题，或许我可以帮助你，毕竟我也是过来人了！</mark></p>
                <p><img src="https://img-blog.csdnimg.cn/20200204002231750.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9pdGh1YW5ncWluZy5ibG9nLmNzZG4ubmV0,size_16,color_FFFFFF,t_70" alt="在这里插入图片描述"></p>
                <p>感谢各位大大的阅读🥰</p>
              </div>
              <div class="more-toolbox">
                <div class="left-toolbox">
                  <ul class="toolbox-list">
                    <li class="tool-item is-like ">
                      <a href="javascript:;">
                        <svg viewBox="0 0 1024 1024"><path d="M609.79708437 520.42532183l-0.66304572 0.00422329c-23.32483876 0-42.23219094-18.90735218-42.23219021-42.23219093a42.13505648 42.13505648 0 0 1 14.35894472-31.72904483l0.02111579-0.02533907c35.50037964-37.58664979 44.84636338-133.21722277 44.84636337-188.77789362 0-13.24823794-12.38247819-41.34531469-42.12660988-41.34531469-24.6298137 0-42.4264591 21.19633634-42.4264591 39.82495581 0 68.73711416-27.05394131 132.25432857-64.35341251 181.61109043-21.33992637 28.24488932-60.29489915 62.13622224-95.22514419 70.6966875-9.80631471 2.40723514-16.53390272 5.71823896-23.43464237 12.85547906-6.50375749 6.72336471-10.6425121 17.31942123-11.09861976 25.24640385v261.06251061h421.4350324l38.55799058-287.17889752h-197.65932312v-0.01266989z m69.72534743-84.46438114h127.93397568c46.74258868 0 84.63331024 37.82315021 84.63331025 84.47705103 0 3.75021829-0.25339288 7.50043735-0.75173285 11.21686999l-38.55376727 287.17889749C847.15466648 860.77877158 811.29953694 892.08971773 768.90264021 892.08971773H347.4633845C300.71657253 892.08971773 262.83007428 854.2707908 262.83007428 807.61688924v-287.17889752c0-41.61137748 30.14533792-76.19954179 69.83092699-83.184746a0.60814355 0.60814355 0 0 1 0.31674168-0.10135775l0.32941084-0.01266916c0.88265295-0.1478126 1.76530592-0.28295601 2.65218217-0.40120622 1.05580461-0.19849147 2.1116092-0.4054288 2.7915474-0.47300013 44.53384503-4.23588907 118.60910769-74.94102243 118.60910844-180.12029467C457.3599918 176.00068954 525.49740827 131.91028227 584.00166244 131.91028227c36.91093488 0 77.44116871 17.55592165 96.35274343 47.45631255 18.91157474 29.90039089 25.71940399 70.91207143 25.719404 114.10293326 0 51.78511277-7.82984818 100.32256971-26.55137807 142.49141261zM174.14247323 440.18838242c23.32483876 0 42.23219094 18.91157474 42.23219093 42.23219095V849.85752677c0 23.32483876-18.90735218 42.23219094-42.23219093 42.23219096s-42.23219094-18.90735218-42.23219096-42.23219096V482.42057337c0-23.32483876 18.90735218-42.23219094 42.23219096-42.23219096z"></path></svg>
                        <span class="name">点赞</span>
                        <span class="count">1736</span>
                      </a>
                    </li>
                    <li class="tool-item is-collection ">
                      <a href="javascript:;">
                        <svg viewBox="0 0 1084 1024"><path d="M1043.275294 379.241412a45.116235 45.116235 0 0 0-36.382118-30.72l-293.165176-42.646588L582.595765 40.237176C575.006118 24.816941 558.561882 17.106824 542.117647 17.106824s-32.888471 7.710118-40.478118 23.130352l-131.132235 265.637648-293.165176 42.646588a45.176471 45.176471 0 0 0-24.997647 77.040941l212.148705 206.787765-50.115764 292.020706a44.995765 44.995765 0 0 0 17.950117 44.15247c13.914353 10.24 32.406588 11.444706 47.585883 3.493647L542.117647 834.138353l262.204235 137.878588c15.179294 8.011294 33.731765 6.746353 47.585883-3.493647a44.875294 44.875294 0 0 0 17.950117-44.15247l-50.115764-292.020706 212.148706-206.787765a44.995765 44.995765 0 0 0 11.38447-46.320941z m-303.646118 204.92047a45.357176 45.357176 0 0 0-13.010823 39.996236l38.671059 225.099294-202.209883-106.37553a45.537882 45.537882 0 0 0-41.923764 0.060236L318.945882 849.317647l38.610824-225.099294a45.357176 45.357176 0 0 0-13.010824-39.996235L180.946824 424.658824l226.063058-32.828236a45.056 45.056 0 0 0 33.972706-24.69647L542.117647 162.273882l101.135059 204.860236c6.565647 13.312 19.275294 22.588235 33.972706 24.69647l226.063059 32.828236-163.659295 159.503058z"></path></svg>
                        <span class="name">收藏</span>
                      </a>
                    </li>
                    <li class="tool-item is-share">
                      <a href="javascript:;">
                        <svg viewBox="0 0 1024 1024"><path d="M409.234286 556.690286a54.857143 54.857143 0 1 0 105.252571 30.793143c39.204571-134.070857 107.081143-270.701714 302.957714-303.689143l-47.542857 68.022857a54.857143 54.857143 0 0 0 89.892572 62.976l122.002285-174.153143a54.784 54.784 0 0 0-13.531428-76.434286L794.112 42.276571a54.857143 54.857143 0 0 0-62.902857 89.819429l64.292571 44.982857c-289.792 52.297143-361.179429 293.814857-386.267428 379.611429z"></path><path d="M937.910857 533.357714a58.514286 58.514286 0 0 0-58.514286 58.514286v246.052571a41.472 41.472 0 0 1-41.472 41.398858H186.002286a41.472 41.472 0 0 1-41.472-41.398858V186.075429c0-22.893714 18.578286-41.398857 41.472-41.398858h299.300571a58.514286 58.514286 0 1 0 0-117.028571H186.002286A158.72 158.72 0 0 0 27.501714 186.075429v651.849142a158.72 158.72 0 0 0 158.500572 158.427429h651.922285a158.72 158.72 0 0 0 158.500572-158.427429V591.872a58.514286 58.514286 0 0 0-58.514286-58.514286z"></path></svg>
                        分享
                      </a>
                    </li>
                    <li class="tool-item tool-more">
                      <a>
                        <svg t="1575545411852" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5717" xmlns:xlink="http://www.w3.org/1999/xlink" width="200" height="200"><defs><style type="text/css"></style></defs><path d="M179.176 499.222m-113.245 0a113.245 113.245 0 1 0 226.49 0 113.245 113.245 0 1 0-226.49 0Z" p-id="5718"></path><path d="M509.684 499.222m-113.245 0a113.245 113.245 0 1 0 226.49 0 113.245 113.245 0 1 0-226.49 0Z" p-id="5719"></path><path d="M846.175 499.222m-113.245 0a113.245 113.245 0 1 0 226.49 0 113.245 113.245 0 1 0-226.49 0Z" p-id="5720"></path></svg>
                        文章举报
                      </a>
                    </li>
                  </ul>
                </div>
              </div>
              <div class="hide-article-box" v-if="!article.open_read">
                <a class="btn-readmore" @click="article.open_read=true">
                  展开阅读全文
                  <svg viewBox="0 0 1820 1024">
                    <path d="M917.33333327 623.189333l332.394667-333.525333a52.906667 52.906667 0 0 1 75.136 0 53.461333 53.461333 0 0 1 0 75.392L956.80000027 734.4a52.864 52.864 0 0 1-39.445334 15.530667 52.672 52.672 0 0 1-39.424-15.530667L509.82400027 365.056a53.418667 53.418667 0 0 1 0-75.392 52.949333 52.949333 0 0 1 75.114666 0L917.33333327 623.189333z m0 0" fill="">
                    </path>
                  </svg>
                </a>
              </div>
            </div>
            <Affix :offset-top="60" class="detail-action">
              <ul>
                <li>
                  <svg class="icon" viewBox="0 0 1024 1024">
                    <path d="M609.79708437 520.42532183l-0.66304572 0.00422329c-23.32483876 0-42.23219094-18.90735218-42.23219021-42.23219093a42.13505648 42.13505648 0 0 1 14.35894472-31.72904483l0.02111579-0.02533907c35.50037964-37.58664979 44.84636338-133.21722277 44.84636337-188.77789362 0-13.24823794-12.38247819-41.34531469-42.12660988-41.34531469-24.6298137 0-42.4264591 21.19633634-42.4264591 39.82495581 0 68.73711416-27.05394131 132.25432857-64.35341251 181.61109043-21.33992637 28.24488932-60.29489915 62.13622224-95.22514419 70.6966875-9.80631471 2.40723514-16.53390272 5.71823896-23.43464237 12.85547906-6.50375749 6.72336471-10.6425121 17.31942123-11.09861976 25.24640385v261.06251061h421.4350324l38.55799058-287.17889752h-197.65932312v-0.01266989z m69.72534743-84.46438114h127.93397568c46.74258868 0 84.63331024 37.82315021 84.63331025 84.47705103 0 3.75021829-0.25339288 7.50043735-0.75173285 11.21686999l-38.55376727 287.17889749C847.15466648 860.77877158 811.29953694 892.08971773 768.90264021 892.08971773H347.4633845C300.71657253 892.08971773 262.83007428 854.2707908 262.83007428 807.61688924v-287.17889752c0-41.61137748 30.14533792-76.19954179 69.83092699-83.184746a0.60814355 0.60814355 0 0 1 0.31674168-0.10135775l0.32941084-0.01266916c0.88265295-0.1478126 1.76530592-0.28295601 2.65218217-0.40120622 1.05580461-0.19849147 2.1116092-0.4054288 2.7915474-0.47300013 44.53384503-4.23588907 118.60910769-74.94102243 118.60910844-180.12029467C457.3599918 176.00068954 525.49740827 131.91028227 584.00166244 131.91028227c36.91093488 0 77.44116871 17.55592165 96.35274343 47.45631255 18.91157474 29.90039089 25.71940399 70.91207143 25.719404 114.10293326 0 51.78511277-7.82984818 100.32256971-26.55137807 142.49141261zM174.14247323 440.18838242c23.32483876 0 42.23219094 18.91157474 42.23219093 42.23219095V849.85752677c0 23.32483876-18.90735218 42.23219094-42.23219093 42.23219096s-42.23219094-18.90735218-42.23219096-42.23219096V482.42057337c0-23.32483876 18.90735218-42.23219094 42.23219096-42.23219096z"></path>
                  </svg>
                  <span class="hover-show">
                    <span class="no-active">点赞</span>
                    <span class="active">取消点赞</span>
                  </span>
                  <p>474</p>
                </li>
                <li>
                  <svg class="icon" viewBox="0 0 1024 1024">
                     <path d="M809.621333 129.344a85.269333 85.269333 0 0 1 85.034667 85.034667v467.712a85.269333 85.269333 0 0 1-85.034667 84.992h-191.338666L512 894.677333l-106.282667-127.573333h-191.338666a85.269333 85.269333 0 0 1-85.013334-84.992V214.357333a85.269333 85.269333 0 0 1 85.013334-85.034666h595.242666z m0 510.208V256.896a42.645333 42.645333 0 0 0-42.538666-42.538667H256.896a42.666667 42.666667 0 0 0-42.538667 42.538667v382.656a42.666667 42.666667 0 0 0 42.538667 42.538667h191.317333L512 767.082667l63.786667-84.992h191.296a42.666667 42.666667 0 0 0 42.538666-42.538667z m-414.72-202.176a53.12 53.12 0 1 1-106.218666 0.021333 53.12 53.12 0 0 1 106.218666-0.021333z m169.984 0a53.12 53.12 0 1 1-106.24 0 53.12 53.12 0 0 1 106.24 0z m169.941334 0a53.12 53.12 0 1 1-106.24 0 53.12 53.12 0 0 1 106.24 0z" fill=""></path>
                  </svg>
                  <span class="hover-show">
                    <span class="no-active">评论</span>
                  </span>
                  <p>474</p>
                </li>
                <li>
                  <a class="hover-box">
                    <svg class="icon" viewBox="0 0 1024 1024">
                      <path d="M409.234286 556.690286a54.857143 54.857143 0 1 0 105.252571 30.793143c39.204571-134.070857 107.081143-270.701714 302.957714-303.689143l-47.542857 68.022857a54.857143 54.857143 0 0 0 89.892572 62.976l122.002285-174.153143a54.784 54.784 0 0 0-13.531428-76.434286L794.112 42.276571a54.857143 54.857143 0 0 0-62.902857 89.819429l64.292571 44.982857c-289.792 52.297143-361.179429 293.814857-386.267428 379.611429z"></path><path d="M937.910857 533.357714a58.514286 58.514286 0 0 0-58.514286 58.514286v246.052571a41.472 41.472 0 0 1-41.472 41.398858H186.002286a41.472 41.472 0 0 1-41.472-41.398858V186.075429c0-22.893714 18.578286-41.398857 41.472-41.398858h299.300571a58.514286 58.514286 0 1 0 0-117.028571H186.002286A158.72 158.72 0 0 0 27.501714 186.075429v651.849142a158.72 158.72 0 0 0 158.500572 158.427429h651.922285a158.72 158.72 0 0 0 158.500572-158.427429V591.872a58.514286 58.514286 0 0 0-58.514286-58.514286z"></path>
                    </svg>
                    <span class="hover-show text">海报</span>
                  </a>
                </li>
                <li>
                  <a class="hover-box">
                    <svg class="icon" viewBox="0 0 1084 1024">
                      <path d="M1043.275294 379.241412a45.116235 45.116235 0 0 0-36.382118-30.72l-293.165176-42.646588L582.595765 40.237176C575.006118 24.816941 558.561882 17.106824 542.117647 17.106824s-32.888471 7.710118-40.478118 23.130352l-131.132235 265.637648-293.165176 42.646588a45.176471 45.176471 0 0 0-24.997647 77.040941l212.148705 206.787765-50.115764 292.020706a44.995765 44.995765 0 0 0 17.950117 44.15247c13.914353 10.24 32.406588 11.444706 47.585883 3.493647L542.117647 834.138353l262.204235 137.878588c15.179294 8.011294 33.731765 6.746353 47.585883-3.493647a44.875294 44.875294 0 0 0 17.950117-44.15247l-50.115764-292.020706 212.148706-206.787765a44.995765 44.995765 0 0 0 11.38447-46.320941z m-303.646118 204.92047a45.357176 45.357176 0 0 0-13.010823 39.996236l38.671059 225.099294-202.209883-106.37553a45.537882 45.537882 0 0 0-41.923764 0.060236L318.945882 849.317647l38.610824-225.099294a45.357176 45.357176 0 0 0-13.010824-39.996235L180.946824 424.658824l226.063058-32.828236a45.056 45.056 0 0 0 33.972706-24.69647L542.117647 162.273882l101.135059 204.860236c6.565647 13.312 19.275294 22.588235 33.972706 24.69647l226.063059 32.828236-163.659295 159.503058z"></path>
                    </svg>
                    <span class="hover-show text">收藏</span>
                  </a>
                </li>
                <li>
                  <a class="hover-box">
                    <svg class="icon" viewBox="0 0 1024 1024">
                      <path d="M399.936 511.786667L736.213333 846.912c20.885333 20.842667 20.970667 54.656 0.192 75.584l-0.192 0.213333a53.909333 53.909333 0 0 1-75.989333 0L287.786667 551.552a53.418667 53.418667 0 0 1-15.701334-39.765333 53.418667 53.418667 0 0 1 15.701334-39.765334L660.224 100.885333a53.866667 53.866667 0 0 1 75.989333 0c20.885333 20.821333 20.970667 54.656 0.192 75.562667l-0.192 0.192-336.277333 335.146667z" fill=""></path>
                    </svg>
                    <span class="hover-show">上一篇</span>
                  </a>
                </li>
                <li>
                  <a class="hover-box">
                    <svg class="icon" viewBox="0 0 1024 1024">
                      <path d="M624.064 511.765333L287.808 176.682667a53.482667 53.482667 0 0 1-0.192-75.562667c0.064-0.042667 0.128-0.128 0.192-0.149333a53.866667 53.866667 0 0 1 76.010667 0l372.352 371.072c10.538667 10.474667 16.277333 24.896 15.701333 39.744a53.290667 53.290667 0 0 1-15.701333 39.765333L363.818667 922.56a53.866667 53.866667 0 0 1-76.010667 0 53.482667 53.482667 0 0 1-0.192-75.562667l0.192-0.128 336.256-335.104z" fill=""></path>
                    </svg>
                    <span class="hover-show">下一篇</span>
                  </a>
                </li>
                <li>
                  <a class="hover-box">
                    <svg class="grant-icon" width="24px" height="24px" viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
                      <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                        <g transform="translate(-1398.000000, -486.000000)" fill-rule="nonzero">
                          <g transform="translate(1398.000000, 486.000000)">
                            <path d="M0,12 C0,16.287187 2.287187,20.2487113 6,22.3923048 C9.7128129,24.5358984 14.2871871,24.5358984 18,22.3923048 C21.712813,20.2487113 24,16.287187 24,12 C24,5.37258296 18.627417,0 12,0 C5.372583,0 0,5.37258296 0,12 Z" id="路径" fill-opacity="0.3" fill="#FF5A52"></path>
                            <path d="M2.09340659,11.9505494 C2.09340659,15.4721673 3.97216734,18.7262766 7.02197798,20.4870856 C10.0717886,22.2478946 13.8293103,22.2478946 16.8791209,20.4870856 C19.9289316,18.7262766 21.8076923,15.4721673 21.8076923,11.9505494 C21.8076923,6.50659974 17.3944991,2.09340659 11.9505495,2.09340659 C6.50659977,2.09340659 2.09340659,6.50659974 2.09340659,11.9505494 Z" id="路径" fill="#F63D47"></path>
                            <path d="M11.3005025,5.28638434 L12.7115578,5.28638434 L12.7115578,6.87854416 L14.1105528,6.87854416 C14.4,6.39607148 14.6592965,5.89550609 14.8884422,5.37081705 L16.1849246,5.82313519 C15.99799,6.23926787 15.7929648,6.58906055 15.5758794,6.88457507 L18,6.88457507 L18,9.84575109 L16.6733668,9.84575109 L16.6733668,8.03647857 L7.33869347,8.03647857 L7.33869347,9.85781291 L6,9.85781291 L6,6.87854416 L8.51457286,6.87854416 C8.31557789,6.52875147 8.08040201,6.1910206 7.80904523,5.86535155 L9.08140703,5.4009716 C9.39497488,5.80504246 9.67236181,6.29957695 9.92562814,6.88457507 L11.3065327,6.88457507 L11.3065327,5.28638434 L11.3005025,5.28638434 Z M12.8571429,13.9657994 C12.6552823,15.5675992 12.2332101,16.6234672 11.5848095,17.1394027 C10.8813559,17.8053195 9.1991844,18.2312662 6.54441188,18.4292415 L6,17.2233922 C8.22046642,17.1394027 9.68854339,16.8454395 10.3919969,16.3415024 C11.0098127,15.8735609 11.3768319,15.0456644 11.4930547,13.8578129 L12.8571429,13.9657994 Z M16.8571429,12.1435272 L16.8571429,15.9892245 L15.5161905,15.9892245 L15.5161905,13.3067319 L9.05523809,13.3067319 L9.05523809,16.1435272 L7.71428571,16.1435272 L7.71428571,12.1435272 L16.8571429,12.1435272 L16.8571429,12.1435272 Z M8.28571429,8.71495577 L15.7142857,8.71495577 L15.7142857,11.5720986 L8.28571429,11.5720986 L8.28571429,8.71495577 L8.28571429,8.71495577 Z M14.5714286,10.4292415 L14.5714286,9.28638434 L10,9.28638434 L10,10.4292415 L14.5714286,10.4292415 Z M12.9579832,16.1435272 C14.8187275,16.4853162 16.4993998,16.9018717 18,17.3931934 L17.2436975,18.4292415 C15.635054,17.8311106 13.9783914,17.3664911 12.2857143,17.0407235 L12.9579832,16.1435272 L12.9579832,16.1435272 Z" id="形状" fill="#FFFFFF"></path>
                          </g>
                        </g>
                      </g>
                    </svg>
                    <span class="hover-show">赏</span>
                  </a>
                </li>
              </ul>
            </Affix>
          </div>
        </Col>
      </Row>
    </div>
  </div>
</template>

<script>
export default {
  layout: 'zhifou',
  asyncData(context) {
    let title = context.app.head.title;
    let key = context.route.params.key;
    return {
      title: title ,

    };
  },
  data(){
    return{
      achievement:[{
        name:'原创',
        number:162
      },{
        name:'粉丝',
        number:9435
      },{
        name:'获赞',
        number:10002
      },{
        name:'评论',
        number:2225
      },{
        name:'访问',
        number:1420000
      }],
      article:{
        slide_content_box_show:false,
        open_read:false
      }
    }
  },
  mounted() {
    let key = this.$route.params.key;
    console.log(key);
  },
  methods:{
    tranNumber(num, point) {
      let numStr = num.toString()
      // 十万以内直接返回
      if (numStr.length < 5) {
          return numStr;
      }
      //大于8位数是亿
      else if (numStr.length > 8) {
          let decimal = numStr.substring(numStr.length - 8, numStr.length - 8 + point);
          return parseFloat(parseInt(num / 100000000) + '.' + decimal) + '亿';
      }
      //大于6位数是十万 (以10W分割 10W以下全部显示)
      else if (numStr.length > 4) {
          let decimal = numStr.substring(numStr.length - 4, numStr.length - 4 + point)
          return parseFloat(parseInt(num / 10000) + '.' + decimal) + '万+';
      }
    }
  }
};
</script>

<style lang="less">
@import url('./_key.less');
</style>
